Revit 2027 API
Entity.Get Method
Overload List
Name | Description
Get<FieldType>(Field) |  Retrieves the value of the field in the entity.
Get<FieldType>(String) |  Retrieves the value of the field in the entity.
Get<FieldType>(Field, ForgeTypeId) |  Retrieves the value of the field in the entity.
Get<FieldType>(String, ForgeTypeId) |  Retrieves the value of the field in the entity.
Top
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace